Revit 2027 API
ExportLayerInfo.CategoryType Property
 The category type which this layer belongs to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LayerCategoryType CategoryType { get; set; }
Public Property CategoryType As LayerCategoryType
	Get
	Set
public:
property LayerCategoryType CategoryType {
	LayerCategoryType get ();
	void set (LayerCategoryType value);
}
member CategoryType : LayerCategoryType with get, set
Property Value
LayerCategoryType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace